#pragma once

//ver 6.0 
//20241117
//name
#define NELM(a) (sizeof(a)/sizeof(a[0])) //Макрос считающий количество элементов строки a


typedef unsigned long long ULL; //создаем сокращение для типа данных 

struct PNs // объединяет различные типы данных под одним именем
{
	ULL Phone : 63; // Переменная Phone может хранить положительные целые числа 
	ULL Plus : 1; //Переменная Plus хранит одно значение
	PNs(ULL phone, char plus) { Phone = phone; Plus = plus; }//ctor
	PNs() { Phone = 0ll; Plus = 0; }//ctor
};

void PrintBin(int A); //перевод номера в двоичный код (передача данных по значению)    

int CleanStr(char* sA); //функция очистки строки (передача данных по указателю)



struct PhRec_s //объединяет различные типы данных под одним именем
{
	PNs PN;  
	char Nick[20];
	PhRec_s() { Nick[0] = '\0'; }
};

int PrintPNs(const PNs* pP); //Функция выводящая знак "+" при необходимости вместе с номером телефона (передача данных по указателю)  
int ReadPNs(PNs& pP); // Функция для работы с введённым номером телефона (передача данных по ссылке)

int PrintPhRec(const PhRec_s* pRec); // Выводит имя и номер контакта (передача данных по указателю)  
int ReadPhRec(PhRec_s& pRec); // функция обрабатывающая введённое оператором значение (передача данных по ссылке)

void StrUpper(std::string& sA); // выполняет преобразование строчных букв в прописные (передача данных по ссылке)