//ver 5.0 
//20241117
//name

#include "iostream"
#include "string.h" // строки
#include "stdio.h" // ввод вывод
#include "..\Лаба4\laba4.h"
#include <string>
#include <iomanip> 

void PrintBin(int x) // функция для перевода числа в двоичный код (передача данных по значению)    
{
	//logic only
	//for
	unsigned int j = 1 << 31; //вводим положительное целое число j от 1 до 31
	unsigned int fields = 0x11111110;
	while (j)  // вводим цикл, который будет повторяться пока условие j не станет ложным
	{

		//if
		if (x & j) // сравнивает каждый бит числа x с числом j
		{
			printf("1"); // если x и j равны 1, то результат будет равен "1"
		}
		//else
		else
		{
			printf("0"); // в другом случае результат будет "0"
		}
		if (fields & j)
			printf(" ");
		j >>= 1; //значение j сдвинуть вправо на один разряд и записать результат в эту же переменную
	}
}



int CleanStr(char* sA) // Вводим функцию чистки заданной строки от не подходящих элементов (передача данных по указателю)
{
	int nRet = 0; // Счёт ошибок

	char* sB = (char*)malloc(strlen(sA) + 1); // выделяем память для переменной sB, которая равна длине введенной строки +1 

	int k = 0; // переменная k - индекс символа строки sB 
	for (int p = 0; p < strlen(sA) + 1; p++) // Цикл for, который исключает из строки лишние символы, оставляя цифры и знак "+"
	{
		if (sA[p] >= '0' && sA[p] <= '9'
			|| (('+' == sA[p])
				&& 0 == k)
			|| 0 == sA[p]) //проверяет каждый символ строки                 || '\-' == sA[p]
		{
			sB[k] = sA[p]; //ввод подходящего символа в строку sB с подходящим индексом 
			k++; //переходит в следующий индекс символа строки sB
		}
		else
			nRet++; // иначе увеличивает количество ошибок на 1
		if ('\0' == sA[p]) // если последний символ равен символу с индексом p
			break; // выход из цикла
	}
	strcpy_s(sA, k, sB); // Записываем значение введённой строки в переменную sA

	free(sB); //очищаем память, выделенную под строку

	return nRet; // возврат счётчика ошибок
}

int PrintPNs(const PNs* pP) // функция для вывода номера телефона (передача данных по указателю)  
{
	std::string fullNumber = '+' + std::to_string(pP->Phone); //чтобы вывести "+" вместе с номером преобразуем введённый номер в строку
	if (pP->Plus)
		std::cout << std::setw(16) << fullNumber; // если в введённом номере есть "+" выводим номер с плюсом
	else 
		std::cout << std::setw(16) << pP->Phone; //если "+" отсутствует введём номер без него

	return 0; // вовзращает функцию
}


int ReadPNs(PNs& pP) // функция для чтения  (передача данных по ссылке) 
{
	std::cout << "Input phone (plus if needed)\n"; // введите номер телефона (плюс при необходимости)
	char in[16]; //массив в который будет записываться номер до 16 символов, так как международный стандарт номера - 15
	scanf_s("%s", in, NELM(in)); //записывает номер в массив
	CleanStr(in); // очищает введённое оператором значение
	if ('+' == in[0])
		pP.Plus = 1; // если на первом месте стоит +, выводим +
	else
		pP.Plus = 0; // если плюса нет, выводим номер без него
	pP.Phone = atoll(in); // конвертирует строку в целое число
	return 0;
}

//int PrintPhRec(const PhRec_s* pRec) // Функция для вывода: имени, номера, двоичного кода (передача данных по указателю)    
//{
//	printf("%8s", pRec->Nick); // выводит Ник и выравнивает таблицу
//	printf_s("\t|");
//	PrintPNs(&(pRec->PN)); // выводит номер телефона
//	printf_s("\t|");
//	PrintBin((pRec->PN.Phone) >> 32);
//	printf(" ");
//	PrintBin((unsigned int)(pRec->PN.Phone)); // переводит номер в двоичный код
//	printf_s("|");
//	printf("\n");
//	return 0;
//}

int ReadPhRec(PhRec_s& pRec) // Функция для ввода имени (передача данных по ссылке)
{
	ReadPNs(pRec.PN);
	std::cout << "Please input your nickname\n"; // выводит строку
	scanf_s("%s", pRec.Nick, _countof(pRec.Nick)); // сканирует введённое оператором значение и записывает его
	return 0;
}

void StrUpper(std::string& sA) //выполняет преобразование строчных букв в прописные (передача данных по ссылке)
{
	for (int i = 0; i < sA.size(); i++) 
		sA[i] = toupper(sA[i]);// переводит строчные буквы в прописные 
}
