//ver 7.0 
//20241212

#pragma once
#include "..\lab5\CPhoneRec.h"

class CPhoneBook
{
public: //данные члены доступны из любой функции
	CPhoneBook(); //конструктор
	~CPhoneBook(); //деструктор
protected: //доступ ограничен содержащим классом или типами, которые являются производными от содержащего класса
	std::vector<CPhoneRec> m_book; //Динамический массив телефонной книжки 
	std::string m_path; 
public:	//данные члены доступны из любой функции
	void Read(); //функция чтения массива
	void Write();//функция записи массива в файл
	void Add();//функция заполнения массива
	int Sort();//функция сортировки
	int Find();//фуункция поиска
	void Print();//функция вывода таблицы 
};

